from enum import StrEnum

START_GREETING = '''\
Привет! 👋 Рад видеть тебя здесь. Готов помочь с выбором автомобиля, который идеально подойдет твоим нуждам и бюджету. \
🚗💭 Давай начнем, у меня есть несколько вопросов, которые помогут понять твои предпочтения.
Если что-то не ясно или нужно больше информации, просто дай знать!\
'''

START_BUTTON = 'Начать'
HELP_BUTTON = 'Помощь 📖'
PRESS_BUTTON_ERROR = 'Жми на кнопки'

HELP = '''\
Бот-автоподборщик 🚗🔍

Добро пожаловать! Я помогу выбрать авто, которое идеально подходит тебе и твоим потребностям. Просто ответь на \
несколько вопросов о своих предпочтениях, и я предложу лучшие варианты в рамках твоего бюджета. Если какой-то параметр \
для тебя не важен, отвечай прочерком "-" или "не важно"\
'''

ASK_BUDGET = '''\
💰 Каков твой бюджет на покупку автомобиля? (например, до 2 миллионов рублей, 2-5 млн рублей, более 5 000 000 руб)\
'''

ASK_VEHICLE_TYPE = '''\
Какой тип автомобиля ты рассматриваешь? 🚗🚙🏎️ (например, седан, внедорожник, купе, кабриолет, электромобиль)\
'''

ASK_PURPOSE = '''\
Для каких целей ты планируешь использовать автомобиль? 🛣️🎒👨‍👩‍👧‍👦 (например, повседневные поездки, дальние путешествия, \
семейные поездки, офф-роуд)\
'''

ASK_FEATURES = '''\
Какие особенности или характеристики автомобиля для тебя важны? ⚙️📋 (например, экономия топлива, наличие \
навигационной системы, безопасность, просторный салон, мощность)\
'''

ASK_CONDITION = 'Предпочитаешь ли ты новый или подержанный автомобиль?'

class Condition(StrEnum):
    NEW = 'Новый'
    USED = 'С пробегом'
    NO_MATTER = 'Не важно'

ASK_MODELS = 'Есть ли предпочтения по марке или модели? 🏷️🚙'

GENERATE_AGAIN_BUTTON = 'Подобрать еще раз 🔄'
TRY_AGAIN_BUTTON = 'Подобрать другое авто ⚙️'
START_AGAIN_BUTTON = 'В начало ⏪'
